app/views/active_plants/_form.html.erb

      <% end %>
      <%= f.input :plant_id, collection: Plant.all, prompt: "Choose wisely" %>
      <td> Location </td>
      <%= f.collection_select :location_id, Location.all, :id, :name,   prompt: "Choose wisely", label: "Location" %>
      <%= f.input :plant_status_id, collection: PlantStatus.all, prompt: "Choose wisely" %>
---
SELECT "plants".* FROM "plants"
SELECT "locations".* FROM "locations"
SELECT "plant_statuses".* FROM "plant_statuses"