app/views/plants/_form.html.erb

SELECT "harvest_types".* FROM "harvest_types"
SELECT "water_amounts".* FROM "water_amounts"
---
         <%= f.input :plant_group %>
         <%= f.association :harvest_type, collection: HarvestType.all, prompt: false %>
         <%= f.association :water_amount, collection: WaterAmount.all, prompt: false %>