app/controllers/active_plants_controller.rb

  def index
    @active_plants = ActivePlant.all
---
SELECT "active_plants".* FROM "active_plants"

  def create
    @active_plant = ActivePlant.new(active_plant_params)
     puts "active_plant_params="+active_plant_params.inspect
    respond_to do |format|
      if @active_plant.save
         #Create a Planting record
         puts "@active_plant.inspect="+@active_plant.inspect
         @planting = Planting.create(active_plant_id: @active_plant.id, plant_status_id: active_plant_params[:plant_status_id], location_id: @active_plant.location_id, count_planted: active_plant_params[:count_active], date_planted: Date.today)
---
INSERT INTO "active_plants" ("comment", "count_active", "created_at", "location_id", "plant_id", "plant_status_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["comment", ""], ["count_active", 21], ["created_at", "2014-06-20 23:07:35.473191"], ["location_id", 97], ["plant_id", 1], ["plant_status_id", 20], ["updated_at", "2014-06-20 23:07:35.473191"]]
INSERT INTO "plantings" ("active_plant_id", "created_at", "date_planted", "location_id", "plant_status_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["active_plant_id", 8], ["created_at", "2014-06-20 23:28:38.934464"], ["date_planted", "2014-06-20"], ["location_id", 96], ["plant_status_id", 19], ["updated_at", "2014-06-20 23:28:38.934464"]]

  def update
    respond_to do |format|
      if @active_plant.update(active_plant_params)
---
UPDATE "active_plants" SET "plant_status_id" = ?, "updated_at" = ? WHERE "active_plants"."id" = 1  [["plant_status_id", 20], ["updated_at", "2014-06-20 23:05:24.674314"]]

    def set_active_plant
      @active_plant = ActivePlant.find(params[:id])
---
SELECT  "active_plants".* FROM "active_plants"  WHERE "active_plants"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "plants".* FROM "plants"  WHERE "plants"."id" = ? LIMIT 1  [["id", 2]]