app/controllers/harvest_types_controller.rb

  def index
    @harvest_types = HarvestType.all
---
SELECT "harvest_types".* FROM "harvest_types"

  def create
    @harvest_type = HarvestType.new(harvest_type_params)

    respond_to do |format|
      if @harvest_type.save
---
INSERT INTO "harvest_types" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-06-19 17:45:25.542024"], ["name", "Single Harvest"], ["updated_at", "2014-06-19 17:45:25.542024"]]

    def set_harvest_type
      @harvest_type = HarvestType.find(params[:id])
---
SELECT  "harvest_types".* FROM "harvest_types"  WHERE "harvest_types"."id" = ? LIMIT 1  [["id", 1]]