app/controllers/locations_controller.rb

  def index
     if(!params[:sort].nil?)
        @locations = Location.order(params[:sort] + ' ' + params[:direction]).all
---
SELECT "locations".* FROM "locations"

  def new
    @location = Location.new
    @soil_types = Soil.all
---
SELECT  "soils".* FROM "soils"   ORDER BY "soils"."id" ASC LIMIT 1

  def create
    @location = Location.new(location_params)

    respond_to do |format|
      if @location.save
---
INSERT INTO "locations" ("comment", "created_at", "name", "size", "soil_id", "sub_name", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["comment", "a"], ["created_at", "2014-06-17 15:41:56.728281"], ["name", "a"], ["size", 7], ["soil_id", 1], ["sub_name", "a"], ["updated_at", "2014-06-17 15:41:56.728281"]]

    def set_location
       puts "$$$$.$$ params=#{params.inspect}"
      @location = Location.find(params[:id])
---
SELECT  "locations".* FROM "locations"  WHERE "locations"."id" = ? LIMIT 1  [["id", 1]]