app/controllers/moon_phases_controller.rb

SELECT "moon_phases".* FROM "moon_phases"
---
  def index
    @moon_phases = MoonPhase.all

INSERT INTO "moon_phases" ("created_at", "image", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-06-16 17:16:53.756510"], ["image", "m1.gif"], ["name", "New Moon"], ["updated_at", "2014-06-16 17:16:53.756510"]]
---
  def create
    @moon_phase = MoonPhase.new(moon_phase_params)

    respond_to do |format|
      if @moon_phase.save

SELECT  "moon_phases".* FROM "moon_phases"  WHERE "moon_phases"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_moon_phase
      @moon_phase = MoonPhase.find(params[:id])