app/controllers/plantings_controller.rb

  def index
     if(!params[:sort].nil?)
        @plantings = Planting.joins(active_plant: :plant).order(params[:sort] + ' ' + params[:direction]).all
     else
        @plantings = Planting.all
---
SELECT "plantings".* FROM "plantings"