app/controllers/plants_controller.rb

SELECT "plants".* FROM "plants"
---
  def index
     if(!params[:sort].nil?)
        @plants = Plant.order(params[:sort] + ' ' + params[:direction]).all

INSERT INTO "plants" ("comment", "created_at", "group", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", ""], ["created_at", "2014-06-20 22:15:40.595300"], ["group", "Perenials"], ["name", "Thyme"], ["updated_at", "2014-06-20 22:15:40.595300"]]
---
  def create
    @plant = Plant.new(plant_params)
   puts "plant_params"+plant_params.to_s
    respond_to do |format|
      if @plant.save

UPDATE "plants" SET "harvest_type_id" = ?, "updated_at" = ?, "water_amount_id" = ? WHERE "plants"."id" = 1  [["harvest_type_id", 1], ["updated_at", "2014-06-20 22:39:55.725217"], ["water_amount_id", 2]]
---
  def update
    respond_to do |format|
      if @plant.update(plant_params)