app/controllers/soils_controller.rb

  def index
    @soils = Soil.all
---
SELECT "soils".* FROM "soils"

  def create
    @soil = Soil.new(soil_params)

    respond_to do |format|
      if @soil.save
---
INSERT INTO "soils" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-06-17 15:07:40.571754"], ["name", "Good Ol Dirt"], ["updated_at", "2014-06-17 15:07:40.571754"]]

    def set_soil
      @soil = Soil.find(params[:id])
---
SELECT  "soils".* FROM "soils"  WHERE "soils"."id" = ? LIMIT 1  [["id", 1]]