app/views/locations/_form.html.erb

      <%= f.input :name, as: :string %>
      <%= f.input :soil_id, collection: Soil.all, prompt: "Choose wisely!" %>
---
SELECT  "soils".* FROM "soils"   ORDER BY "soils"."id" ASC LIMIT 1